Revit 2026 API
LightType.SetInitialColor Method
 Replace the current initial color object with the given object
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public void SetInitialColor(
	InitialColor initialColor
)
Public Sub SetInitialColor (
	initialColor As InitialColor
)
public:
void SetInitialColor(
	InitialColor^ initialColor
)
member SetInitialColor :
        initialColor : InitialColor -> unit
Parameters
initialColor InitialColor
 An object derived from an InitialColor object The object pointed to is cloned internally
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The argument object is cloned
See Also
Reference
LightType Class
Autodesk.Revit.DB.Lighting Namespace